resources/public/year-in-review-2015.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Year in Review 2015</title>
<!-- 2018-04-03 Tue 14:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ed Babcock (greenyouse)" />
<meta  name="description" content="Hacks, projects, and general butt-kicking with Ed (greenyouse)"
 />
<meta  name="keywords" content="Clojure, ClojureScript, greenyouse, LISP" />
<meta name='viewport' content='width=device-width' initial-scale=1>
                     <link rel='shortcut icon' href='/img/favicon.ico' />
                     <link rel='stylesheet' href='/css/bootstrap.min.css' type='text/css'/>
                     <link rel='stylesheet' href='/css/blog.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar navbar-default">
    <div class="container-fluid">
      <div class="navbar-header">
        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#main-navbar">
          <span class="sr-only">Toggle navigation</span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </button>
        <a class="navbar-brand" href="/index.html">Blog - Ed Babcock</a>
      </div>
      <div class="collapse navbar-collapse" id="main-navbar">
        <ul class="nav navbar-nav">
          <li><a href="/about.html">About</a></li>
          <li><a href="categories.html">Categories</a></li>
          <li><a target="_blank" href="https://github.com/greenyouse">Projects</a></li>

        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Year in Review 2015</h1>
<p>
Here's a snapshot of what 2015 looked like for me. I wrote it up at the
end of December so I'm going to call it OK even though it's actually
being published in 2016.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Books</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Number Read</h3>
<div class="outline-text-3" id="text-1-1">
<p>
12
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Number Published</h3>
<div class="outline-text-3" id="text-1-2">
<p>
0 (but I helped as a technical editor for <a href="https://www.packtpub.com/big-data-and-business-intelligence/clojure-finance">Clojure for Finance</a>)
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Favorite Book of the Year</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The Book of Shen (3rd Edition)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Programming</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Number of Blog Posts</h3>
<div class="outline-text-3" id="text-2-1">
<p>
1 (ouch, I need to work on this :p)
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Number of New Programming Projects</h3>
<div class="outline-text-3" id="text-2-2">
<p>
5
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Favorite Programming Language Found</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Shen
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Languages Used for Work</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Clojure
</li>
<li>ClojureScript
</li>
<li>JavaScript
</li>
<li>PHP
</li>
<li>Java
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Languages Used for Fun</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Erlang
</li>
<li>Haskell
</li>
<li>Shen
</li>
<li>Clojure
</li>
<li>ClojureScript
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Favorite Music Album Found</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://www.youtube.com/watch?v=wPlJnJ4uLPY&list=PLyE0IASFARwCq3IOVdRfBVXrQrkihgXwx">Joan As Police Woman - The Deep Field</a>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Favorite Show</h2>
<div class="outline-text-2" id="text-4">
<p>
(Still) Game of Thrones
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">New (non-programming) Languages Tried</h2>
<div class="outline-text-2" id="text-5">
<p>
Mandarin Chinese
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">TODOs for next year</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Get better at PHP, Java, Shen, Erlang, Haskell, Clojure(Script), and
JavaScript.
</li>
<li>Understand more of the math behind Category Theory and how to
practically apply it to software development.
</li>
<li>Write a library on top of cat-theory operations that makes data
transformations easy.
</li>
<li>Try Writing ElasticSearch and SQL libraries on top of the cat-theory
library.
</li>
<li>Use Erlang to build a proper implementation of the phantom protocol.
</li>
<li>Figure out a decent way to abstract app development across platforms
(started this but haven't touched it since last spring and it could
use a lot of work).
</li>
<li>Have fun in general with some new projects!
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer> <hr />
                         <p><a href='http://creativecommons.org/licenses/by-nc-sa/3.0/' target='_blank'>©copyright 2015</a>, by <a href='/about.html'>Ed Babcock</a> (^_^)v</p>
                         </footer>
                         <script type='text/javascript' src='js/jquery.min.js'></script>
                         <script type='text/javascript' src='js/bootstrap.min.js'></script>
</div>
</body>
</html>